/*--------------------------------------------------------------------
/* File name   : DLED.h
/* Author      : nbufe
/* Copyright(C): 2021-2022 nbufe. All rights reserved.
/*--------------------------------------------------------------------
 */
#ifndef __DLED_H_
#define __DLED_H_

/* 包含头文件 -------------------------------------------------------*/
#include "STC8Ax_REG.H"
#include <intrins.h>

/* 类型定义 ---------------------------------------------------------*/
/* None. */

/* 宏定义 -----------------------------------------------------------*/
/* None. */

/* 扩展变量 ---------------------------------------------------------*/
/* None. */

/* 函数声明 ---------------------------------------------------------*/
void DigLED_Display();
void DisplayLoad(unsigned char index, unsigned char number, unsigned char dot);

#endif /* __DLED_H_ */

/*>>>>>>>>>> (C) COPYRIGHT NBUFE <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/

