/* ---------------------------------- 包含头文件 --------------------------------- */
#include "KeyScan.h"

/* ---------------------------------- 私有宏定义 --------------------------------- */
#define KEY_TIME 20 // 按键去抖时间

/* ---------------------------------- 扩展变量 ---------------------------------- */
uint8 flag = 0;

/* ---------------------------------- 私有变量 ---------------------------------- */
uint8 keysign1 = 0; // 按键状态初始化

uint8 keyt1 = 0; // 按键去抖计时

/* ----------------------------------- 函数 ----------------------------------- */
/**
 * @brief 按键扫描
 * @param none
 * @note 改变Keysign的值
*/
void KeyScan()
{
    if (key_sr1 == 1) // k1没被按下
    {
        keysign1 = 0; // 按键1标志
        keyt1 = 0;
    }
    else if (keysign1 == 0) // k1被按下且标志为0
    {
        keyt1++;
        if (keyt1 >= KEY_TIME) // 按键去抖
        {
            keyt1 = 0;
            keysign1 = 1; // 清除标志以防再次进入
            flag = !flag;
        }
    }
}
