/*-------------------------------------------------------------------------------
/*       (C) Copyright 2023, PSYM. All Rights Reserved
/*-------------------------------------------------------------------------------
/* File name   : ntc_temp_calc.c
/* Description :
/* Author      : PSYM
/*-------------------------------------------------------------------------------
/* Update note:
/* -----------   -----------   --------------------------------------------------
/*    Date         Author                              Note
/* -----------   -----------   --------------------------------------------------
/* 2023-06-14       PSYM
/*   09:16
**/

/* ---------------------------------- 包含头文件 ---------------------------------- */
#include "ntc_temp_calc.h"

/* ---------------------------------- 私有宏定义 ---------------------------------- */
#define T25 (25 + 273.15) // T25 = 25 + 273.15
#define R25 (10)          // 25摄氏度下对应的NTC电阻值为10千欧，注意此处单位为千欧，因此传入的Rntc单位也要一致为千欧
#define RES_UP (5.0)     // 上拉采样电阻 RES_UP = 5.0K
#define AVDD_MV (3300)    // AD电源电压 3300mv
#define BX (3950)         // NTC 材料参数 B 值
#define ABS_0 (273.15)    //

/* ---------------------------------- 私有类型定义 ---------------------------------- */
/* None. */

/* ---------------------------------- 私有变量 ---------------------------------- */
/* None. */

/* ---------------------------------- 扩展变量 ---------------------------------- */
/* None. */

/* ---------------------------------- 私有函数原型 ---------------------------------- */
/* None. */

/* ---------------------------------- 函数体 ---------------------------------- */

/**
 * @brief: 温度计算函数
 * @param: vdd_value为内部电压值
 *       TempADCValue为对应AD检测的电压值（在电路中采样电阻 R 的电压）
 * @return: 返回温度值
 * @note: 1.需要添加头文件"math.h"
 *        2.数学中ln是以e为底数(lne2=2)(ln为自然对数
 *         e=2.7182818284590452353602874713527…)
 *         math.h只有两个函数log和log10,其中log代表数学上的ln
 *         函数 log10(x) 以10为底的对数,即 lg(x),以其它数为底的对数用换底公式来表示
 *         此NTC温度计算公式只需要用到log这个函数即可。
 */
int16 NTC_TempValue_Calculate(uint32 TempADCValue_mv)
{
    float tmp = 0;

    /*
     必须要乘以1.0，才能得到浮点数0.51，否则得到的数值为0；
     因为：整型/整型=整型，而无法得到浮点型，即 51/100 = 0 ; 而51*1.0/100 = 0.51
    */
    tmp = (RES_UP * 1.0) / R25;                                // R/R0
    tmp = tmp * TempADCValue_mv / (AVDD_MV - TempADCValue_mv); //* V/(VDD-V)
    tmp = log(tmp);
    tmp /= BX;             // /B
    tmp *= T25;            // *(T0+273.15)
    tmp = T25 / (tmp + 1); // T
    tmp -= ABS_0;          // -273.15
    return tmp + 0.5;
}

/*>>>>>>>>>> (C) COPYRIGHT PSYM <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/
