/*--------------------------------------------------------------------
/* File name   : STC8Ax_INIT.h
/* Author      : nbufe
/* Copyright(C): 2021-2022 nbufe. All rights reserved.
/*--------------------------------------------------------------------
 */
#ifndef __STC8Ax_INIT_H_
#define __STC8Ax_INIT_H_

/* 包含头文件 -------------------------------------------------------*/
#include "STC8Ax_GPIO.h"
#include "uart_printf.h"
#include "AD.h"

/* 类型定义 ---------------------------------------------------------*/
/* None. */

/* 宏定义 -----------------------------------------------------------*/
/* None. */

/* 扩展变量 ---------------------------------------------------------*/
/* None. */

/* 函数声明 ---------------------------------------------------------*/
void System_Init();
void Time0_Config();
void Peripheral_Init();

#endif /* __STC8Ax_INIT_H_ */

/*>>>>>>>>>> (C) COPYRIGHT NBUFE <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/

