/*-------------------------------------------------------------------
/*      (C) Copyright 2021-2022, nbufe. All Rights Reserved
/*-------------------------------------------------------------------
/* File name   : STC8Ax_Init.c
/* Description :
/* Author      : nbufe
/*-------------------------------------------------------------------
/* Update note:
/* ---------   -----------   ----------------------------------------
/*   Date        Author                       Note
/* ---------   -----------   ----------------------------------------
/*
/*
**/

/* 包含头文件 -------------------------------------------------------*/
#include "STC8Ax_INIT.h"

/* 私有类型定义 -----------------------------------------------------*/
/* None. */

/* 私有宏定义 -------------------------------------------------------*/
/* None. */

/* 私有变量 ---------------------------------------------------------*/
/* None. */

/* 扩展变量 ---------------------------------------------------------*/
/* None. */

/* 私有函数原形 -----------------------------------------------------*/
/* None. */

/* 函数体 -----------------------------------------------------------*/

/* 第一区 初始化单片机 */
/**
 * 功能：初始化单片机
 * 参数：None
 * 返回：None
 * 说明：
 */
void System_Init()
{
    // 初始化P0端口的所有引脚为浮空输入模式
    GPIO_Init(GPIO_P0, Pin_Low, GPIO_MODE_IN_FLOATING);

    // 初始化P1端口的所有引脚为推挽输出模式
    GPIO_Init(GPIO_P1, Pin_All, GPIO_MODE_OUT_PP);

    // 初始化P2端口的所有引脚为推挽输出模式
    GPIO_Init(GPIO_P2, Pin_All, GPIO_MODE_OUT_PP);

    AD_Init();
	Time0_Config();
	UART1_Init();
}

/**
 *
 * 功能：初始化外围设备
 * 参数：None
 * 返回：None
 * 说明：
 */
void Time0_Config() //初始化外围
{
    //1毫秒@24.000MHz
    AUXR &= 0x7F;		//定时器时钟12T模式
    TMOD &= 0xF0;		//设置定时器模式
    TL0 = 0x30;			//设置定时初始值
    TH0 = 0xF8;			//设置定时初始值
	ET0 = 1;
    TF0 = 0;			//清除TF0标志
    TR0 = 1;			//定时器0开始计时
}

/* 第二区 初始化外围 */
/**
 *
 * 功能：初始化外围设备
 * 参数：None
 * 返回：None
 * 说明：
 */
void Peripheral_Init() //初始化外围
{
    EA = 1;//打开串口中断和总中断允许
}

/*>>>>>>>>>> (C) COPYRIGHT NBUFE <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/
